GT3/setup_TM/RANS-liencubicKE/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
/*
    default         Gauss linear;
    grad(U)         Gauss linear;
    grad(p)         Gauss linear;
*/

    default         cellLimited Gauss linear 1;
    grad(k)         cellLimited Gauss linear 1;
    grad(epsilon)   cellLimited Gauss linear 1;
}

divSchemes
{
    default         none;

    limitedGauss    cellLimited Gauss linear 1;
    div(phi,U)      bounded Gauss linearUpwindV limitedGauss;

    //div(U,p)     Gauss linear;

    div(phi,k)     		bounded Gauss linearUpwind default;
    div(phi,epsilon)		bounded Gauss linearUpwind default;
    //div(phi,nuTilda)      	bounded Gauss upwind;

    div((nuEff*dev2(T(grad(U))))) Gauss linear;
    div(nonlinearStress) Gauss linear;
}

laplacianSchemes
{
    default 	   Gauss linear limited 1;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 1;
}

wallDist
{
    method         meshWave;
}

// ************************************************************************* //
