GT3/setup_TM/RANS-liencubicKE/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs ("libsampling.so");

setFormat raw;

surfaceFormat raw;

interpolationScheme cellPoint;

// Fields to sample.
fields
(
   //grad(U) U y kl kt nut omega 
   grad(U) U nut k epsilon
);

sets
(
   line0045
   {
     type lineCell;
     axis y;
     start (0.045 0.0 1.e-6);
     end   (0.045 0.1 1.e-6);
   }
   line0095
   {
      type lineCell;
     axis y;
     start (0.095 0.0 1.e-6);
     end   (0.095 0.1 1.e-6);
   }
   line0195
   {
      type lineCell;
     axis y;
     start (0.195 0.0 1.e-6);
     end   (0.195 0.1 1.e-6);
   }
   line0295
   {
     type lineCell;
     axis y;
     start (0.295 0.0 1.e-6);
     end   (0.295 0.1 1.e-6);
   }
   line0395
   {
     type lineCell;
     axis y;
     start (0.395 0.0 1.e-6);
     end   (0.395 0.1 1.e-6);
   }
   line0495
   {
     type lineCell;
     axis y;
     start (0.495 0.0 1.e-6);
     end   (0.495 0.1 1.e-6);
   }
   line0595
   {
     type lineCell;
     axis y;
     start (0.595 0.0 1.e-6);
     end   (0.595 0.1 1.e-6);
   }
   line0695
   {
     type lineCell;
     axis y;
     start (0.695 0.0 1.e-6);
     end   (0.695 0.1 1.e-6);
   }
   line0795
   {
     type lineCell;
     axis y;
     start (0.795 0.0 1.e-6);
     end   (0.795 0.1 1.e-6);
   }
   line0895
   {
     type lineCell;
     axis y;
     start (0.895 0.0 1.e-6);
     end   (0.895 0.1 1.e-6);
   }
   line0995
   {
     type lineCell;
     axis y;
     start (0.995 0.0 1.e-6);
     end   (0.995 0.1 1.e-6);
   }
   line1095
   {
     type lineCell;
     axis y;
     start (1.095 0.0 1.e-6);
     end   (1.095 0.1 1.e-6);
   }
   line1195
   {
     type lineCell;
     axis y;
     start (1.195 0.0 1.e-6);
     end   (1.195 0.1 1.e-6);
   }
   line1295
   {
     type lineCell;
     axis y;
     start (1.295 0.0 1.e-6);
     end   (1.295 0.1 1.e-6);
   }
   y01
   {
     type lineCell;
     axis x;
     start (-1 0.1 1.e-6);
     end   (3 0.1 1.e-6);
   }
   
);

// *********************************************************************** //
